:PROPERTIES:
:ID:       cf847bc5-31f7-4bb8-8324-7680a8f2953d
:END:
#+TITLE:     Shell
#+AUTHOR:    David Conner
#+EMAIL:     noreply@te.xel.io
#+DESCRIPTION: notes

*** Append to =stdin= stream

+ 3,2,1 output reversed. Nothing outputs until =tee= receives newline. Shell
  hangs, typing =4\n= prepends a line
+ bash stdin gets bound when nothing pipes (doesn't work in org-babel)
  - Any newlines will terminate (even =C-j= to type newline)

#+begin_src sh
tee -a >(echo 1)  | tee -a >(echo 2)  | tee -a >(echo 3)
#+end_src

#+RESULTS:
| 3 |
| 2 |
| 1 |

#+begin_src sh
tee -a >(echo .) >(echo 1)  | tee -a >(echo 2)  | tee -a >(echo "3")
#+end_src

#+RESULTS:
| 3 |
| 2 |
| . |
| 1 |

#+begin_src sh
#+end_src

**** Arrays

#+begin_src bash
echo "# args: $#"
echo "@ args: $@"
echo "* args: $*"

# same symbols in arrays/hashes
foo=("'1'" "'2'" a$'\t'bc)
echo "${#foo} ${#foo[@]} ${#foo[*]}"
bar="${foo[@]}" && echo $bar
bar="${foo[*]}" && echo $bar
#+end_src

#+RESULTS:
| #   | args: | 0 |    |
| @   | args: |   |    |
| *   | args: |   |    |
| 3   | 3     | 3 |    |
| '1' | '2'   | a | bc |
| '1' | '2'   | a | bc |

